In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('flights.csv')

In [13]:
df.head(5)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [14]:
print('head', df.head(5))
print(df['year'].describe())

head    year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121
count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
25%      1951.750000
50%      1954.500000
75%      1957.250000
max      1960.000000
Name: year, dtype: float64

In [12]:
df[['year', 'month']][0:10]

   year      month
0  1949    January
1  1949   February
2  1949      March
3  1949      April
4  1949        May
5  1949       June
6  1949       July
7  1949     August
8  1949  September
9  1949    October

In [15]:
df.year.value_counts()

1949    12
1950    12
1951    12
1952    12
1953    12
1954    12
1955    12
1956    12
1957    12
1958    12
1959    12
1960    12
Name: year, dtype: int64

In [16]:
df.month.value_counts()

January      12
February     12
March        12
April        12
May          12
June         12
July         12
August       12
September    12
October      12
November     12
December     12
Name: month, dtype: int64